models/User.php

SELECT * FROM `teacher` WHERE email = 'eff9@alu.ua.es'
SELECT * FROM `student` WHERE email = 'eff9@alu.ua.es'
SELECT * FROM `user` WHERE email = 'eff9@alu.ua.es'
---
    public static function getUserById($email)
    {
        $user = null;

        $query = new Query;
        $query->select("*")
            ->from("teacher")
            ->where("email = '$email'");
        $result = $query->one();
        if(is_array($result))
            $user = self::genUser($result, true);
        else {
            $query->select("*")
                ->from("student")
                ->where("email = '$email'");
            $result = $query->one();
            if(is_array($result))
                $user = self::genUser($result, false);
        }

        if($user != null){
            $query->select("*")
                ->from("user")
                ->where("email = '$email'");
            $result = $query->one();